package study0206;

import java.util.Scanner;

public class javatest1 {

	public static void main(String[] args) {
		/*
		 문제 1 - 무한루프
		  정수 한 개씩 계속 입력 받기
		  입력 하다가 0을 입력하면 
		  지금까지 입력한 모든 숫자의 합 출력
		  
		  
		 문제 2 - 무한루프
		 컴퓨터와 가위 바위 보 게임하기
		  내가 10번을 이길 때 까지 계속 게임하기
		  10번 이기면 그동안 몇번 패배하고 몇번 비겼는지 출력
          		 
		 문제 3 
		 컴퓨터와 주사위 게임을 한다.
		 각각 주사위 2개를 던져서 주사위 합이 큰쪽이 이긴다.
		 단, 주사위 2개가 같은 숫자라면 합이 작아도 이긴다.
		 둘다 같은 숫자가 나왔다면 합이 큰쪽이 이긴다.
		 예) 나 - 3,4  컴 - 1,3 내가 이김
		    나 -5,6 컴 -1,1 컴퓨터 이김
		 5판을 진행 했을 때 몇승 몇패 몇무 인지 출력
		*/
		
		
		}
		}
	
	
		
		
		

	    	
	    	
	    
		
			
		


